       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO.
       PROCEDURE DIVISION.
       DISPLAY "Hello, COBOL! Hello Aurelius! Das ist ein Git Test :)".
       STOP RUN.
